Revit 2027 API
Definitions.Contains Method
Tests for the existence of a definition within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	Definition definition
)
Public Function Contains (
	definition As Definition
) As Boolean
public:
bool Contains(
	Definition^ definition
)
member Contains :
        definition : Definition -> bool
Parameters
definition Definition
The definition to look for.
Return Value
Boolean
True if the definition was found, false otherwise.
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace